from django.http import HttpResponse
from django.shortcuts import render
from django.core.files.storage import FileSystemStorage


def details(request):
    context = {'title':'Список чертежей', 'content':'Список чертежей:', 
               'acln':['АЦЛН.005001.000.00','АЦЛН.005001.000.01','АЦЛН.005001.000.02','АЦЛН.005001.000.03', 
                       'АЦЛН.005001.000.00','АЦЛН.005001.000.01','АЦЛН.005001.000.02','АЦЛН.005001.000.03', 
                       'АЦЛН.005001.000.00','АЦЛН.005001.000.01','АЦЛН.005001.000.02','АЦЛН.005001.000.03', 
                       'АЦЛН.005001.000.00','АЦЛН.005001.000.01','АЦЛН.005001.000.02','АЦЛН.005001.000.03', 
                       'АЦЛН.005001.000.00','АЦЛН.005001.000.01','АЦЛН.005001.000.02','АЦЛН.005001.000.03', 
                       'АЦЛН.005001.000.00','АЦЛН.005001.000.01','АЦЛН.005001.000.02','АЦЛН.005001.000.03', 
                       'АЦЛН.005001.000.00','АЦЛН.005001.000.01','АЦЛН.005001.000.02','АЦЛН.005001.000.03', 
                       'АЦЛН.005001.000.00','АЦЛН.005001.000.01','АЦЛН.005001.000.02','АЦЛН.005001.000.03', 
                       'АЦЛН.005001.000.00','АЦЛН.005001.000.01','АЦЛН.005001.000.02','АЦЛН.005001.000.03', 
                       'АЦЛН.005001.000.00','АЦЛН.005001.000.01','АЦЛН.005001.000.02','АЦЛН.005001.000.03', 
                       'АЦЛН.005001.001.00','АЦЛН.005001.002.00']}    
    context1 = {'title':'Список чертежей', 'content':'Список чертежей:', 
               'acln':['АЦЛН.005001.000.00','АЦЛН.005001.000.01']}
    return render(request, "details/info.html", context)

def number(request, specification):
    context = {'title':'Список чертежей', 'content':'Деталь', 
               'acln': 'details/img/plan.jpg'}
    return render(request, "details/acln.html", context)